Repository: kvlvskyyy/slaptop
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: nl

source: Back to All Stickers
nl: Terug naar alle stickers

source: Meet the Team
nl: Maak kennis met het team

source: Team leader
nl: Teamleider

source: Add New Sticker (Admin)
nl: Sticker Toevoegen(Admin)

source: Price (€)
nl: Prijs (€)

source: Stock
nl: Voorraad

source: Select a category
nl: Selecteer een categorie

source: Category
nl: Categorieën

source: Description
nl: Beschrijving

source: Description (Optional)
nl: Beschrijving (optioneel)

source: Sticker Image
nl: Stickerafbeelding

source: Publish Sticker
nl: Publiceer sticker

source: Create Your Own Sticker
nl: Maak je eigen stickers

source: Sticker Name
nl: Stickernaam

source: Request Sticker
nl: Sticker aanvragen

source: Cancel
nl: Annuleren

source: Confirm
nl: Bevestigen

source: Customer Details
nl: Klantgegevens

source: Order contents
nl: Bestel inhoud

source: Search...
nl: Zoeken...

source: Categories
nl: Categorieën

source: Search for stickers...
nl: Zoeken naar stickers...

source: Create Sticker
nl: Sticker Maken

source: Admin Menu
nl: Beheerdermenu

source: User Dashboard
nl: Gebruikersdashboard

source: View requests
nl: Verzoeken bekijken

source: Add Sticker
nl: Sticker Toevoegen

source: Orders list
nl: Bestellingenlijst

source: English
nl: Engels

source: Dutch
nl: Nederlands

source: Sign up
nl: Registreren

source: Log in
nl: Inloggen

source: Log out
nl: Uitloggen

source: My orders
nl: Mijn bestellingen

source: My sticker requests
nl: Mijn sticker verzoeken

source: you really think we wanna accept phone calls?
nl: We antwoorden wanneer we daar zin in hebben.

source: Quick links
nl: Snelle koppelingen

source: About Us
nl: Over ons

source: Shipping Information
nl: Verzendinformatie

source: Terms & Conditions
nl: Algemene voorwaarden

source: Returns and Refunds
nl: Retour- en restitutiebeleid

source: Your Privacy Policy
nl: Uw privacybeleid

source: Follow Us
nl: Volg ons

source: Stay connected for updates, new designs, and exclusive offers!
nl: Blijf op de hoogte voor updates, nieuwe ontwerpen en exclusieve aanbiedingen!

source: Payment Canceled!
nl: Betaling geannuleerd

source: Forgot to add something to your cart? Shop around and come back to pay.
nl: Vergeten iets aan je winkelmandje toe te voegen? Kijk gerust even verder en kom later terug om af te rekenen.

source: Return to Cart
nl: Terug naar winkelwagen

source: Continue Shopping
nl: a door met winkelen

source: Shopping Cart
nl: Winkelwagen

source: Your cart is empty.
nl: Je winkelwagen is leeg.

source: Total:
nl: Totaal:

source: Proceed to checkout
nl: Ga verder naar afrekenen

source: Searched Category:
nl: Gezochte categorie:

source: Your sticker shop is ready 🚀
nl: Uw stickerwinkel is klaar voor gebruik🚀

source: No stickers found matching this category.
nl: Geen stickers gevonden in de database.

source: Checkout
nl: Uitchecken

source: Your order:
nl: Uw bestelling

source: Full Name
nl: Volledige naam

source: Payment Method
nl: Betaalmethode

source: Cash
nl: Contant geld

source: Place Order
nl: Bestelling plaatsen

source: Checkout Successful
nl: Betaling succesvol

source: Thank you for your order!
nl: Bedankt voor uw bestelling.

source: Order ID:
nl: Bestel-ID

source: You will receive a confirmation email shortly at
nl: Je ontvangt binnenkort een bevestigingsmail op

source: Order Summary:
nl: Besteloverzicht:

source: Back to Admin Panel
nl: Terug naar het beheerderspaneel

source: Edit Sticker:
nl: Sticker bewerken

source: Price
nl: Prijs

source: Current Image:
nl: Huidige afbeelding:

source: Replace Image (Optional)
nl: Afbeelding vervangen (Optional)

source: Update Sticker Details
nl: Update stickerinformatie

source: Customize your stuff
nl: Pas je spullen aan

source: Order some cool stickers to put on your device
nl: Bestel coole stickers voor je apparaat

source: Create your own stickers
nl: Maak je eigen stickers

source: Request your own sticker design to print
nl: Vraag je eigen stickerontwerp aan om af te drukken

source: Get started
nl: Aan de slag

source: Fast and easy
nl: Snel en gemakkelijk

source: Select, order, pickup, stick it!
nl: Selecteren, bestellen, afhalen, plakken!

source: Check out our team!
nl: Ontmoet ons team!

source: Who are the developers?
nl: Wie zijn de ontwikkelaars?

source: About us
nl: Over ons

source: Previous
nl: Vorig

source: Next
nl: Volgende

source: Manage Stickers
nl: Beheer stickers

source: Add New Sticker
nl: Sticker Toevoegen

source: Edit
nl: Bewerking

source: Delete this sticker?
nl: Deze sticker verwijderen?

source: Delete
nl: Verwijderen

source: No stickers found in the database.
nl: Geen stickers gevonden in de database.

source: Login
nl: Inloggen

source: Email address
nl: E-mailadres

source: Password
nl: Wachtwoord

source: Don't have an account? Sign up
nl: Heb je geen account? Meld je aan

source: Back to Shop
nl: Terug naar Winkel

source: My Custom Requests
nl: Mijn aangepaste verzoeken

source: New Request
nl: Nieuwe verzoeken

source: Preview
nl: Vorschau

source: Date
nl: Datum

source: You haven't submitted any custom sticker requests yet.
nl: Je hebt nog geen aanvragen voor gepersonaliseerde stickers ingediend.

source: Payment Options
nl: Betaalmethode

source: Choose Payment Method
nl: Betaalmethode kiezen

source: 💵 Cash (pay on pickup)
nl: 💵 Contant (betalen bij afhalen)

source: 💳 Stripe (card payment)
nl: 💳 Stripe (kaartbetaling)

source: Continue
nl: Doorgaan

source: Shipping information
nl: Verzendinformatie

source: Privacy Policy
nl: Privacybelei

source: Last Updated: December 15, 2025
nl: Laatst bijgewerkt: December 15, 2025

source: This Privacy Policy describes how Stickerdom uses, and discloses your Personal Information when you visit or make a purchase from our site.
nl: Dit privacybeleid beschrijft hoe Stickerdom uw gegevens gebruikt en openbaar maakt.Persoonlijke gegevens wanneer u onze site bezoekt of een aankoop doet.

source: 1. Information We Collect
nl: . Informatie die we verzamele

source: We collect Personal Information you provide to us when you visit the Webshop, create an account, or place an order. This information is necessary for us to fulfill your order and provide customer service.
nl: Wij verzamelen de persoonsgegevens die u ons verstrekt wanneer u onze website bezoekt.Webshop, maak een account aan of plaats een bestelling. Deze informatie is noodzakelijk.zodat we uw bestelling kunnen verwerken en u van dienst kunnen zijn.

source: 1.1. Information Collected Directly from You:
nl: 1.1. Informatie die rechtstreeks van u wordt verzameld:

source: Identity and Contact Data: Name, email address, username, and telephone number.
nl: Identiteits- en contactgegevens: naam, e-mailadres, gebruikersnaam en telefoonnummernummer

source: Order Data: Shipping address, billing address, and details of the products you purchased.
nl: Bestelgegevens: verzendadres, factuuradres en productdetailsjij hebt gekocht.

source: Payment Data: Since we charge for packing and delivery, we collect payment details (e.g., credit card information, bank details) processed by a third-party payment gateway (see Section 3). We do not store full credit card numbers on our servers.
nl: Betaalgegevens: Omdat we kosten in rekening brengen voor verpakking en verzending, innen we de betaling.gegevens (bijv. creditcardgegevens, bankgegevens) verwerkt door een derde partijBetalingsgateway van derden (zie paragraaf 3). Wij bewaren geen volledige creditcardgegevens.cijfers op onze servers.

source: Account Data: Password (stored securely as a hash) and login details.
nl: Accountgegevens: Wachtwoord (veilig opgeslagen als een hash) en inloggegevens.

source: 1.2. Information Collected Automatically:
nl: 1.2. Automatisch verzamelde informatie:

source: When you browse our Webshop, we automatically collect certain information about your device and interaction with the site, including:
nl: Wanneer u onze webshop bezoekt, verzamelen we automatisch bepaalde gegevens.over uw apparaat en interactie met de site, inclusief:

source: Device Information: IP address, web browser type, operating system.
nl: Apparaatinformatie: IP-adres, type webbrowser, besturingssysteem.

source: Usage Information: Pages viewed, referring websites, and timestamps.
nl: Gebruiksinformatie: Bekeken pagina's, verwijzende websites en tijdstempels.

source: 2. How We Use Your Personal Information
nl: 2. Hoe wij uw persoonsgegevens gebruiken

source: We use your Personal Information to:
nl: Wij gebruiken uw persoonsgegevens om:

source: Fulfill Orders: To process your payment for packing/delivery fees, arrange for local pickup/delivery, and provide you with invoices and order confirmations.
nl: Bestellingen verwerken: Om uw betaling voor verpakkings-/verzendkosten te verwerken, moet u een afspraak maken.Voor afhalen/bezorgen ter plaatse, en wij voorzien u van facturen en bestellingen.bevestiging

source: Account Management: To manage your registration and provide you with account services.
nl: Accountbeheer: Om uw registratie te beheren en u een account te verstrekken.diensten.

source: Communication: To communicate with you regarding your orders, pickups, and account status.
nl: Communicatie: Om met u te communiceren over uw bestellingen, afhalingen enaccountstatus.

source: Improvement: To screen our orders for potential risk or fraud, and to generally improve and optimize our Webshop (e.g., by generating analytics about how our customers browse and interact with the site).
nl: Verbetering: Om onze bestellingen te screenen op mogelijke risico's of fraude, en om

source: 3. Sharing Your Personal Information
nl: 3. Het delen van uw persoonlijke informatie

source: We share your Personal Information with third parties to help us run our webshop and fulfill our obligations to you.
nl: Wij delen uw persoonlijke gegevens met derden om ons te helpen bij het uitvoeren van onze webshop en onze verplichtingen jegens u nakomen.

source: Third party
nl: Derde partij

source: Purpose
nl: Doel

source: Data Shared
nl: Gedeelde gegevens

source: Payment Processors
nl: Betalingsverwerkers

source: To securely process and verify payments for packing/delivery fees.
nl: Om betalingen voor verpakkings-/bezorgkosten veilig te verwerken en te verifiëren.

source: Payment Data (e.g., card number, expiration date), Billing Address.
nl: Betalingsgegevens (bijv. kaartnummer, vervaldatum), factuuradres.

source: Shipping/Logistics
nl: Verzending/Logistiek

source: To manage the local pickup scheduling process.
nl: Het beheer van het planningsproces voor lokale afhalingen.

source: Name, Email, Order Details, Pickup Time Slot.
nl: Naam, e-mailadres, bestelgegevens, tijdstip van afhalen.

source: School administration
nl: Schooladministratie

source: For administrative purposes, such as verifying student/staff status for pickup eligibility.
nl: Voor administratieve doeleinden, zoals het controleren van de status van studenten/personeel voor recht op afhaling.

source: Name, Email (upon request, and only as necessary).
nl: Naam, e-mailadres (op verzoek en alleen indien nodig).

source: Analytics Providers
nl: Analytics-aanbieders

source: To understand website usage (e.g., Google Analytics).
nl: Om het gebruik van de website te begrijpen (bijvoorbeeld Google Analytics).

source: Device Information, Usage Information (anonymized where possible).
nl: Apparaatinformatie, gebruiksinformatie (waar mogelijk geanonimiseerd).

source: 4. Security
nl: 4. Beveiliging

source: We take reasonable steps to secure your Personal Information from unauthorized access, use, or disclosure. Please be aware that no security system is impenetrable, and we cannot guarantee the complete security of your data.
nl: Wij nemen redelijke maatregelen om uw persoonlijke gegevens te beveiligen tegen ongeoorloofde toegang, gebruik of openbaarmaking. Houd er rekening mee dat er geen beveiliging is. Het systeem is ondoordringbaar en we kunnen de volledige veiligheid niet garanderen. uw gegevens.

source: 5. Your Rights
nl: 5. Uw rechten

source: You have the right to access the Personal Information we hold about you, to ask that your Personal Information be corrected, and to ask that your Personal Information be deleted. If you would like to exercise this right, please contact us through the contact information below.
nl: U hebt het recht om toegang te krijgen tot de persoonlijke gegevens die wij over u bewaren, om vragen om correctie van uw persoonlijke gegevens en om Persoonlijke gegevens worden verwijderd. Als u van dit recht gebruik wilt maken, Neem dan contact met ons op via onderstaande contactgegevens.

source: 6. Data Retention
nl: 6. Bewaring van gegevens

source: When you place an order through the Webshop, we will retain your Order Information for our records for [e.g., a minimum of three years] unless and until you ask us to delete this information.
nl: Wanneer u een bestelling plaatst via de webshop, bewaren wij uw bestelling. Informatie voor onze administratie gedurende [bijvoorbeeld minimaal drie jaar], tenzij en totdat u ons vraagt om deze informatie te verwijderen.

source: 7. Changes to this Policy
nl: 7. Wijzigingen in dit beleid

source: We may update this Privacy Policy from time to time in order to reflect changes to our practices or for other operational, legal, or regulatory reasons. We will post the updated policy on this page.
nl: We kunnen dit privacybeleid van tijd tot tijd bijwerken om rekening te houden met wijzigingen in onze praktijken of om andere operationele, wettelijke of regelgevende redenen redenen. We zullen het bijgewerkte beleid op deze pagina publiceren.

source: 8. Contact Us
nl: 8. Neem contact met ons op

source: For more information about our privacy practices, if you have questions, or if you would like to make a complaint, please contact us by e-mail at stickerdom.help@gmail.com .
nl: stickerdom.help@gmail.com .

source: Returns and Refunds Policy
nl: Retour- en restitutiebeleid

source: Policy Status: All Sales Final (No Returns Accepted)
nl: Beleid: Alle verkopen zijn definitief (geen retourzendingen geaccepteerd)

source: Due to the nature of our products (low-cost custom items) and the operation of our webshop as a school project, Stickerdom maintains an All Sales Are Final policy. Please review this policy carefully before completing your purchase.
nl: Vanwege de aard van onze producten (goedkope op maat gemaakte artikelen) en de bedrijfsvoering van onze webshop als schoolproject, Stickerdom hanteert een beleid waarbij alle verkopen Definitief beleid. Lees dit beleid zorgvuldig door voordat u uw aankoop.

source: 1. No Returns or Exchanges
nl: 1. Geen retournering of omruiling

source: We do not accept returns, exchanges, or offer monetary refunds for any product once the order has been confirmed, except in the specific cases outlined below (Damaged Goods or Order Cancellation).
nl: Wij accepteren geen retourzendingen, ruilingen of bieden geen geldelijke terugbetalingen voor welke reden dan ook

source: 2. Defective or Damaged Products (The Exception)
nl: 2. Defecte of beschadigde producten (de uitzondering)

source: While we strive for high quality, if your sticker order arrives damaged, defective, or if you receive the wrong product, we will replace the item free of charge.
nl: Hoewel we streven naar hoge kwaliteit, geldt dat als uw stickerbestelling beschadigd aankomt, defect is, of als u het verkeerde product ontvangt, zullen wij het artikel vervangen. gratis.

source: To report damaged or incorrect items:
nl: Om beschadigde of verkeerde artikelen te melden:

source: You must notify us via email at stickerdom.help@gmail.com within 7 days of your scheduled pickup date.
nl: U dient ons hiervan binnen 7 dagen na ontvangst per e-mail op de hoogte te stellen via stickerdom.help@gmail.com. op de door u geplande ophaaldatum.

source: 3. Your email must include:
nl: 3. Uw e-mail moet het volgende bevatten:

source: Your Order Number.
nl: Uw bestelnummer.

source: A description of the defect or damage.
nl: Een beschrijving van het defect of de schade.

source: Clear photographic evidence of the defect or damage.
nl: Duidelijk fotografisch bewijs van het defect of de schade.

source: Upon verification, we will arrange for a replacement of the affected items to be processed for the next available pickup schedule. We do not offer cash refunds for damaged items; we only offer replacements.
nl: Na verificatie zullen wij zorgen voor vervanging van de betreffende artikelen. om te worden verwerkt voor de eerstvolgende ophaalbeurt. Wij bieden geen contant geld aan. restituties voor beschadigde artikelen; wij bieden alleen vervangende artikelen aan.

source: Order Cancellation and Refunds (The Fee Exception)
nl: Annulering van bestellingen en terugbetalingen (uitzondering op de kosten)

source: If you need to cancel your order, please contact us immediately.
nl: Als u uw bestelling wilt annuleren, neem dan onmiddellijk contact met ons op.

source: Cancellation BEFORE Processing: If you cancel your order within 2 hours of payment and before production has begun, we will refund the amount paid for packing and delivery fees using the original payment method.
nl: Annulering VOORAFGAAND aan verwerking: Als u uw bestelling binnen 2 uur na betaling en voordat de productie is begonnen, zullen wij het betaalde bedrag terugbetalen voor verpakkings- en verzendkosten via de oorspronkelijke betaalmethode.

source: Cancellation AFTER Processing: Once your order has been sent to the printer or packaged for pickup, it cannot be canceled, and no refund for packing/delivery fees will be issued.
nl: Annulering NA verwerking: zodra uw bestelling naar de drukker is verzonden of verpakt voor afhaling, kan het niet worden geannuleerd en is er geen restitutie mogelijk voor Er worden verpakkings-/bezorgkosten in rekening gebracht.

source: 4. Non-Refundable Fees
nl: 4. Niet-restitueerbare kosten

source: Please note that the following items are non-refundable:
nl: Houd er rekening mee dat de volgende artikelen niet kunnen worden geretourneerd:

source: Fees paid for packing, handling, or delivery once the order has been processed (see Section 3).
nl: Kosten betaald voor verpakking, afhandeling of levering nadat de bestelling is geplaatst verwerkt (zie paragraaf 3).

source: Items lost, damaged, or stolen after they have been successfully picked up by the customer.
nl: Verloren, beschadigde of gestolen artikelen nadat ze zijn opgehaald door de klant.

source: Search Results for "{{ query }}"
nl: Zoekresultaten voor "{{ query }}"

source: No stickers found matching your search.
nl: Geen stickers gevonden in de database.

source: Welcome to Stickerdom! Since our stickers are free and produced locally, we currently offer one convenient method for receiving your order: Scheduled Local Pickup.
nl: Welkom bij Stickerdom! Omdat onze stickers gratis zijn en lokaal worden geproduceerd, kunnen we bieden momenteel één handige methode om uw bestelling te ontvangen: gepland Lokale afhaling.

source: Method
nl: Methode

source: Local Pickup (Scheduled Time Slot)
nl: Lokale afhaling (gepland tijdvak)

source: Cost
nl: Kosten

source: Availability
nl: Beschikbaarheid

source: This is the only method currently offered for receiving stickers.
nl: Dit is momenteel de enige methode om stickers te ontvangen.

source: Delivery area
nl: Leveringsgebied

source: Available for everyone.
nl: Beschikbaar voor iedereen.

source: 2. The Pickup Process
nl: 2. Het afhaalproces

source: To ensure efficiency and minimal disruption, all orders must be collected at a pre-booked time slot.
nl: Om efficiëntie en minimale verstoring te garanderen, moeten alle bestellingen worden opgehaald bijeen vooraf gereserveerd tijdslot.

source: 2.1. Order Readiness Notification
nl: 2.1. Kennisgeving van gereedheid van de bestelling

source: After you successfully complete the mock checkout process, your order will be placed in our production queue.
nl: Nadat u het proefafrekenproces met succes hebt doorlopen, wordt uw bestelling in onze productiewachtrij worden geplaatst.

source: You will receive an Order Confirmation Email immediately.
nl: U ontvangt onmiddellijk een e-mail ter bevestiging van uw bestelling.

source: Once your stickers have been printed and packaged (usually within [e.g., 2-3 school days]), you will receive a second email—the "Ready for Pickup" Notification. This email confirms your order is complete and contains a link to the scheduling tool.
nl: Zodra uw stickers zijn gedrukt en verpakt (meestal binnen [bijvoorbeeld 2-3

source: 2.2. Scheduling Your Pickup Time
nl: 2.2. Uw ophaaltijd plannen

source: Click the link in your "Ready for Pickup" Notification email.
nl: Klik op de link in je e-mailbericht ‘Klaar voor afhaling’.

source: Select an available 10-minute time slot that works best for you. Available slots are typically between [e.g., 12:30 PM - 1:30 PM] and [e.g., 3:30 PM - 4:30 PM] on school days.
nl: Selecteer een beschikbaar tijdvak van 10 minuten dat u het beste uitkomt. Beschikbaar slots zijn doorgaans tussen [bijvoorbeeld 12:30 uur - 13:30 uur] en [bijvoorbeeld 15:30 uur - 16:30 uur] op schooldagen.

source: You will receive a final confirmation with the exact time and location details.
nl: details.

source: 2.3. Pickup Location
nl: 2.3. Afhaalpunt

source: Your pickup location is centralized for easy access:
nl: Uw afhaallocatie is centraal gelegen voor gemakkelijke toegang:

source: Location Detail
nl: Locatiegegevens

source: Building
nl: Gebouw

source: Floor
nl: Vloer

source: 1st Floor
nl: 1e verdieping

source: Specific Spot
nl: Specifieke plek

source: Near ISSD
nl: In de buurt van ISSD

source: 3. Important Notes for Collection
nl: 3. Belangrijke opmerkingen voor het ophalen

source: Proof of Order: When collecting your stickers, you MUST be prepared to show either your Order Confirmation Email or your Pickup Time Slot Confirmation (printed or on your phone) to the staff member/student volunteer.
nl: Bewijs van bestelling: Wanneer u uw stickers komt ophalen, MOET u bereid zijn om het volgende te tonen uw orderbevestigingsmail of uw bevestiging van het afhaaltijdstip (afgedrukt of op uw telefoon) aan de medewerker/student-vrijwilliger.

source: Identification: Please have your ID card or student card ready for verification.
nl: Identificatie: Houd uw identiteitskaart of studentenkaart bij de hand voor

source: Missed Slots: If you miss your scheduled time slot, you must re-schedule your pickup via the link provided in your "Ready for Pickup" notification email. We cannot guarantee same-day collection outside of the pre-booked slots.
nl: slots

source: Maximum Hold Time: Orders must be collected within [e.g., 14 school days] of receiving the "Ready for Pickup" notification. Orders not collected after this time will be considered abandoned and the stickers may be redistributed.
nl: Maximale bewaartermijn: Bestellingen moeten binnen [bijvoorbeeld 14 schooldagen] worden opgehaald. ontvangst van de melding ‘Klaar voor afhaling’. Bestellingen die niet worden afgehaald na deze keer wordt beschouwd als verlaten en de stickers kunnen worden herverdeeld.

source: Need Assistance?
nl: Hulp nodig?

source: If you have any issues with scheduling your pickup time or questions about your order status, please contact us immediately:
nl: Als u problemen heeft met het plannen van uw ophaaltijd of vragen heeft over uw bestelstatus, neem dan onmiddellijk contact met ons op:

source: Sign Up
nl: Registreren

source: Create Account
nl: Account aanmaken

source: Username
nl: Gebruikersnaam

source: Confirm Password
nl: Wachtwoord bevestigen

source: Already have an account? Login
nl: Heb je al een account? Inloggen

source: Designed and sold by
nl: Ontworpen en verkocht door

source: In Stock
nl: Op voorraad

source: Product Description
nl: Productbeschrijving
