Repository: kvlvskyyy/slaptop
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: nl

source: No description available.
nl: Geen beschrijving beschikbaar.

source: Add to Cart
nl: Toevoegen aan winkelwagen

source: Order Confirmed – Cash Payment
nl: Bestelling bevestigd – Contante betaling

source: Order Confirmed ✅
nl: Bestelling bevestigd✅

source: You’ve chosen
nl: Je hebt gekozen

source: Cash Payment
nl: Contante betaling

source: Please note that payment will be made
nl: Houd er rekening mee dat de betaling zal worden uitgevoerd

source: either
nl: ofwel

source: upon delivery
nl: bij levering

source: or at the
nl: of op de

source: checkpoint
nl: controlepunt

source: depending on your selected delivery option.
nl: afhankelijk van de door u gekozen leveringsoptie.

source: Make sure you have the exact amount ready.
nl: Zorg ervoor dat u het exacte bedrag bij de hand hebt.

source: Our team will contact you if any additional details are needed.
nl: Ons team neemt contact met u op als er aanvullende informatie nodig is.

source: Thanks for your order!
nl: Bedankt voor uw bestelling!

source: Thank You! 🎉
nl: Dank u wel! 🎉

source: We appreciate your business! If you have any questions, please email
nl: Wij waarderen uw klandizie! Als u vragen heeft, kunt u een e-mail sturen naar

source: Order Confirmed – Tikkie Payment
nl: Bestelling bevestigd – Tikkie-betaling

source: Tikkie Payment
nl: Tikkie

source: You can pay directly to the sticker seller using
nl: U kunt rechtstreeks aan de verkoper van de stickers betalen met

source: Follow the instructions you will receive to complete the payment.
nl: Volg de instructies die u ontvangt om de betaling te voltooien.

source: Once the payment is confirmed, your order will be processed and delivered.
nl: Zodra de betaling is bevestigd, wordt uw bestelling verwerkt en geleverd.

source: Custom Sticker Requests
nl: Aanvragen voor stickers op maat

source: Approval Status:
nl: Goedkeuringsstatus:

source: Dashboard Request:
nl: Dashboardaanvraag

source: Submitted on:
nl: Ingezonden op:

source: Approve
nl: Goedkeuren

source: Deny
nl: Ontkennen

source: Add to Dashboard
nl: Toevoegen aan dashboard

source: No suggestions found.
nl: Geen suggesties gevonden.

source: Terms and Conditions
nl: Algemene voorwaarden

source: Last Updated: December 12, 2025
nl: Laatst bijgewerkt: 12 december 2025

source: Welcome to Stickerdom. These Terms and Conditions govern your use of the Stickerdom website and the purchase of any products (stickers) offered through it. By accessing or using our Webshop, you agree to be bound by these Terms.
nl: Welkom bij Stickerdom. Deze algemene voorwaarden zijn van toepassing op uw gebruik van de De website Stickerdom en de aankoop van alle aangeboden producten (stickers) door middel daarvan. Door onze webshop te bezoeken of te gebruiken, gaat u akkoord met de volgende voorwaarden: deze Voorwaarden.

source: 1. General Conditions
nl: 1. Algemene voorwaarden

source: 1.1. Acceptance of Terms: By placing an order with Stickerdom, you represent that you are at least the age of majority in your state or province of residence, or that you are the age of majority in your state or province of residence and you have given us your consent to allow any of your minor dependents to use this site.
nl: 1.1. Aanvaarding van de voorwaarden: Door een bestelling te plaatsen bij Stickerdom, verklaart u dat u ten minste meerderjarig bent in uw staat of provincie van woonplaats, of dat u meerderjarig bent in uw staat of provincie van woonplaats en u hebt ons toestemming gegeven om uw minderjarige kinderen toe te laten. afhankelijke personen om deze site te gebruiken.

source: 1.2. Changes to Terms: We reserve the right to update, change, or replace any part of these Terms by posting updates and changes to our Webshop. It is your responsibility to check this page periodically for changes.
nl: 1.2. Wijzigingen in de voorwaarden: Wij behouden ons het recht voor om deze voorwaarden bij te werken, te wijzigen of te vervangen. elk onderdeel van deze Voorwaarden door updates en wijzigingen op onze Webshop te plaatsen. Het is het is uw verantwoordelijkheid om deze pagina regelmatig te controleren op wijzigingen.

source: 2. Products and Ordering
nl: 2. Producten en bestellen

source: 2.1. Product Descriptions: We attempt to be as accurate as possible in the description of our products (stickers). However, we do not warrant that product descriptions, colors, or other content on the Webshop are always accurate, complete, reliable, current, or error-free.
nl: 2.1. Productbeschrijvingen: We streven ernaar zo nauwkeurig mogelijk te zijn in de beschrijving van onze producten (stickers). Wij garanderen echter niet dat productbeschrijvingen, kleuren of andere inhoud op de webshop zijn altijd nauwkeurig, volledig, betrouwbaar, actueel of foutloos.

source: 2.2. Pricing: All prices are listed in EUR and are subject to change without notice. The price displayed at the time of checkout is the final price, excluding shipping costs and applicable taxes.
nl: 2.2. Prijzen: Alle prijzen zijn vermeld in EUR en kunnen zonder voorafgaande kennisgeving worden gewijzigd. Let op. De prijs die bij het afrekenen wordt weergegeven, is de definitieve prijs. exclusief verzendkosten en toepasselijke belastingen.

source: 2.3. Availability: Products are subject to availability. If a product is out of stock after your order is placed, we will notify you and refund the full amount using the original payment method.
nl: 2.3. Beschikbaarheid: Producten zijn afhankelijk van beschikbaarheid. Als een product niet meer leverbaar is Als het product niet meer op voorraad is nadat je je bestelling hebt geplaatst, brengen we je op de hoogte en krijg je het volledige bedrag terug. bedrag met behulp van de oorspronkelijke betaalmethode.

source: 3. Ordering and Billing
nl: 3. Bestellen en facturering

source: 3.1. Sticker Pricing (No Cost): All stickers provided by Stickerdom are offered to the user at no monetary cost (i.e., free). This is because we utilize resources, including the sticker printer, provided by the school for educational and community purposes. The transaction is structured to gather necessary information for shipping and processing but will not result in any financial charge for the stickers themselves.
nl: 3.1. Prijzen stickers (gratis): Alle stickers die door Stickerdom worden geleverd, zijn aan de gebruiker aangeboden zonder financiële kosten (d.w.z. gratis). Dit komt omdat wij gebruik maken van middelen, waaronder de stickerprinter, die door de school worden verstrekt voor educatieve en maatschappelijke doeleinden. De transactie is zo gestructureerd dat noodzakelijke informatie voor verzending en verwerking, maar zal niet leiden tot enige financiële kosten voor de stickers zelf.

source: 3.2. Shipping and Service Fees: While the stickers are free, we reserve the right to charge fees for shipping, handling, or packaging costs, if applicable. Any such fees will be clearly displayed and itemized during the checkout process. If shipping fees are charged, these fees are non-refundable once the order has been processed and shipped.
nl: 3.2. Verzend- en servicekosten: Hoewel de stickers gratis zijn, behouden wij ons het recht voor om het recht om kosten in rekening te brengen voor verzending, verwerking of verpakking, indien van toepassing. Dergelijke kosten worden duidelijk weergegeven en gespecificeerd tijdens de afrekenproces. Als er verzendkosten in rekening worden gebracht, zijn deze kosten niet-restitueerbaar zodra de bestelling is verwerkt en verzonden.

source: 3.3. Billing Information and Mock Checkout: To successfully process and ship your order, and to comply with standard e-commerce practices, you will be required to enter billing and shipping information during the checkout process. You agree to provide current, complete, and accurate billing and account information.
nl: 3.3. Factuurgegevens en proefafrekening: Om succesvol te kunnen verwerken en verzenden uw bestelling, en om te voldoen aan de standaardpraktijken voor e-commerce, wordt u vereist om factuur- en verzendgegevens in te voeren tijdens het afrekenen proces. U stemt ermee in om actuele, volledige en nauwkeurige facturerings- en accountgegevens.

source: Important: Even though you may be prompted to enter payment details (such as a credit card number) during the checkout simulation, no charge will be placed on your account for the stickers, unless specifically for a shipping or processing fee clearly indicated at checkout. The purpose of this step is solely to demonstrate the full order placement process.
nl: Belangrijk: ook al wordt u gevraagd om betalingsgegevens in te voeren (zoalseen creditcardnummer) tijdens de kassasimulatie, worden er geen kosten in rekening gebracht. op uw account geplaatst voor de stickers, tenzij specifiek voor verzending of verwerkingskosten die duidelijk worden aangegeven bij het afrekenen. Het doel van deze stap is uitsluitend om het volledige bestelproces te demonstreren.

source: 3.4. Order Acceptance: The acceptance of your order is subject to availability and our discretion. We reserve the right to refuse any order placed with us. We may, in our sole discretion, limit or cancel quantities purchased per person.
nl: 3.4. Aanvaarding van de bestelling: De aanvaarding van uw bestelling is onderworpen aan beschikbaarheid en naar eigen goeddunken. Wij behouden ons het recht voor om elke bestelling te weigeren. bij ons geplaatst. Wij kunnen naar eigen goeddunken de hoeveelheden beperken of annuleren. per persoon gekocht.

source: 4. Shipping and Delivery
nl: 4. Verzending en levering

source: 4.1. Shipping Costs: Shipping costs are calculated based on your location and the total weight of the order, and will be presented to you at checkout.
nl: 4.1. Verzendkosten: Verzendkosten worden berekend op basis van uw locatie. en het totale gewicht van de bestelling, en wordt bij het afrekenen aan u getoond.

source: 4.2. Delivery Estimates: Any delivery dates provided are estimates. Stickerdom is not liable for any delays in shipments.
nl: 4.2. Geschatte leveringstermijnen: Alle opgegeven leveringstermijnen zijn schattingen. Stickerdom is niet aansprakelijk voor vertragingen in verzendingen.

source: 4.3. Risk of Loss: The risk of loss and title for all items purchased from the Webshop passes to you upon our delivery to the shipping carrier. We are not responsible for packages lost or stolen after being marked as delivered by the carrier.
nl: 4.3. Risico van verlies: Het risico van verlies en eigendom van alle artikelen die zijn gekocht bij de webshop wordt aan u overgedragen op het moment dat wij deze aan de vervoerder leveren. Wij zijn niet verantwoordelijk voor pakketten die verloren gaan of gestolen worden nadat ze als afgeleverd zijn gemarkeerd door de vervoerder.

source: 5. Returns, Refunds, and Exchanges
nl: 5. Retourzendingen, terugbetalingen en omruilingen

source: 5.1. Custom-Made Stickers: If we offer custom-designed stickers, they are non-returnable and non-refundable unless the product is defective or damaged upon arrival.
nl: 5.1. Op maat gemaakte stickers: Als wij op maat gemaakte stickers aanbieden, zijn deze niet retourneerbaar en niet restitueerbaar, tenzij het product defect of beschadigd is bij aankomst.

source: 6. Intellectual Property and Design
nl: 6. Intellectueel eigendom en ontwerp

source: 6.1. Webshop Content: All content on this Webshop, including text, graphics, logos, product images, and design, is the property of Stickerdom and protected by copyright and intellectual property laws.
nl: 6.1. Inhoud van de webshop: Alle inhoud op deze webshop, inclusief tekst, afbeeldingen, logo's, productafbeeldingen en ontwerpen zijn eigendom van Stickerdom en beschermd door auteursrecht en intellectuele eigendomsrechten.

source: 6.2. Sticker Designs: All original sticker designs sold on the Webshop are the intellectual property of Stickerdom or licensed to us. You may not reproduce, duplicate, or resell any part of the service or products without express written permission from us.
nl: 6.2. Stickerontwerpen: Alle originele stickerontwerpen die in de webshop worden verkocht, zijn het intellectuele eigendom van Stickerdom of aan ons in licentie gegeven. U mag niet enig deel van de dienst of producten reproduceren, dupliceren of doorverkopen zonder uitdrukkelijke schriftelijke toestemming van ons.

source: 6.3. User-Submitted Content: If you submit a design for a custom sticker, you warrant that you own or have the necessary licenses, rights, and permissions to use and authorize us to use all intellectual property rights in and to your submission. You agree to indemnify Stickerdom against any claims arising from a breach of this warranty.
nl: 6.3. Door gebruikers ingezonden inhoud: Als u een ontwerp voor een gepersonaliseerde sticker indient, u garandeert dat u de eigenaar bent van of beschikt over de benodigde licenties, rechten en toestemming om alle intellectuele eigendomsrechten te gebruiken en ons te machtigen deze te gebruiken in en naar uw inzending. U stemt ermee in Stickerdom te vrijwaren tegen alle claims die voortvloeien uit een schending van deze garantie.

source: 7. Limitation of Liability
nl: 7. Beperking van aansprakelijkheid

source: In no case shall Stickerdom, its directors, officers, employees, affiliates, agents, contractors, interns, suppliers, service providers, or licensors be liable for any injury, loss, claim, or any direct, indirect, incidental, punitive, special, or consequential damages of any kind, including, without limitation, lost profits, lost revenue, lost savings, or loss of data, arising from your use of any product purchased from the Webshop.
nl: In geen geval zullen Stickerdom, haar directeuren, functionarissen, werknemers, gelieerde ondernemingen, agenten, aannemers, stagiaires, leveranciers, dienstverleners of licentiegevers zijn aansprakelijk voor enig letsel, verlies, claim of enige directe, indirecte, incidentele, strafrechtelijke, bijzondere of gevolgschade van welke aard dan ook, met inbegrip van, maar niet beperkt tot beperking, gederfde winst, gederfde inkomsten, gederfde besparingen of verlies van gegevens, die voortvloeit uit uw gebruik van een product dat u in de webshop hebt gekocht.

source: 8. Governing Law
nl: 8. Toepasselijk recht

source: These Terms and any separate agreements whereby we provide you Services shall be governed by and construed in accordance with the laws of The Netherlands.
nl: Deze Voorwaarden en alle afzonderlijke overeenkomsten op grond waarvan wij u Diensten leveren zal worden beheerst door en geïnterpreteerd in overeenstemming met de wetten van The Nederland.

source: 9. Contact Information
nl: 9. Contactgegevens

source: Questions about the Terms and Conditions should be sent to us at stickerdom.help@gmail.com .
nl: stickerdom.help@gmail.com .

source: My order history
nl: Mijn bestelgeschiedenis

source: Order
nl: Bestelling
